[System]
; 全局开关，设为 0 将禁用所有功能
Enable=1

[Font]
; 是否启用字体Hook (0 = 关闭, 1 = 开启)
Enable=1

; 字体文件名（必须放在游戏根目录或重定向文件夹内）
; 若留空则使用系统默认字体
FileName=galgame.ttf

; 字体名称（CreateFont 中的 FaceName）
; 建议与 FileName 中的字体内名称保持一致
FaceName=galgame

; 字体字符集 (128 = Shift-JIS, 134 = GB2312, 1 = Default)
; 如果汉化后出现乱码尝试改为 134 或 1
Charset=128

; 是否启用字体名称替换 (0 = 关闭, 1 = 开启)
; 设为0时不会将字体名替换为 FaceName 指定的字体
EnableFaceNameReplace=1

; 是否启用字符集替换 (0 = 关闭, 1 = 开启)
; 设为0时不会修改原始字符集
EnableCharsetReplace=0

; 是否启用字体高度缩放 (0 = 关闭, 1 = 开启)
EnableHeightScale=1
; 字体高度缩放比例 (支持小数，例如 0.9 或 1.2)
; 用于修正汉化后字体过大或过小的问题
HeightScale=1.0

; 是否启用字体宽度缩放 (0 = 关闭, 1 = 开启)
EnableWidthScale=1
; 字体宽度缩放比例 (支持小数，例如 0.8 或 1.5)
; 用于调整字体横向宽窄
WidthScale=1.0

; 是否启用字体粗细调整 (0 = 关闭, 1 = 开启)
EnableWeight=1
; 字体粗细 (0 = 默认, 400 = 标准, 700 = 粗体)
; 注意：设为0表示使用程序原本请求的粗细
Weight=0

; 是否启用 Codepage Spoof (0 = 关闭, 1 = 开启)
; 开启后会将游戏请求的 SpoofFromCharset 字符集伪装成 SpoofToCharset
EnableCodepageSpoof=0

; 需要被替换的源字符集 (128 = Shift-JIS)
SpoofFromCharset=128

; 替换后的目标字符集 (1 = DEFAULT_CHARSET/ANSI, 134 = GB2312)
SpoofToCharset=1

[Window]
; 是否启用窗口标题修改 (0 = 关闭, 1 = 开启)
Enable=1

; 标题修改模式
; 0 = API Hook模式：拦截创建窗口函数，启动瞬间即改名，防止首屏闪烁。
; 1 = 事件监听模式：基于Windows事件驱动，不占CPU，解决API拦截不到的特殊引擎。
; 2 = 混合模式 (推荐)：结合以上两者，兼顾“启动不闪烁”和“运行中防偷跑”。
TitleMode=2

; 自定义窗口标题内容
Title=我是一只大肥鸭

[FileRedirect]
; 是否启用文件重定向 (0 = 关闭, 1 = 开启)
; 开启后，游戏读取文件时会优先从 Folder 指定的文件夹中查找
Enable=1

; 重定向文件夹名称 (默认为 Nepgear)
Folder=Nepgear

; 压缩包文件名（如果使用压缩模式）
ArchiveFile=Nepgear.chs

[FileHook]
; VFS读取模式
; 0 ：物理读取模式
; 1 ：内存读取模式
VFSMode=1

[LocaleEmulator]
; 是否启用区域模拟集成 (0 = 关闭, 1 = 开启)
; 只有设置为 1 时才会将 LoaderDll.dll 和 LocaleEmulator.dll 载入游戏根目录并执行区域
Enable=0

; 代码页 (932 = 日文 Shift-JIS, 936 = 中文 GBK)
CodePage=932

; 区域 ID (1041 = 日本, 2052 = 中国)
LocaleID=1041

; 字符集 ID (128 = Shift-JIS, 134 = GB2312)
Charset=128

; 时区设置 (Tokyo Standard Time = 东京时区, China Standard Time = 中国标准时间)
Timezone=Tokyo Standard Time

[CodePage]
; 将源代码页转换为目标代码页 (Hook MultiByteToWideChar / WideCharToMultiByte)
; 适用于需要修改 CodePage 而非 Charset 的游戏引擎
Enable=0
FromCodePage=932
ToCodePage=65001

[Debug]
; 是否开启调试控制台 (0 = 关闭, 1 = 开启)
; 开启后会弹出一个 CMD 窗口显示 Hook 时的日志（用于排查文件加载等）
Enable=0
; 是否开启Nepgear.log日志 (0 = 关闭, 1 = 开启)
LogToFile=0
